app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Bennett"], ["updated_at", "2020-04-04 02:29:47.718874"], ["id", 3]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params)